## dev plan
```
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00f675e927e318400]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::994647055425:policy/andrei-eks-elb-sl-role-creation20220318130253013100000001]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::994647055425:policy/andrei-eks-deny-log-group20220318130253018900000003]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=andrei-eks20220318130253017400000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f739aa38270edde7]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253742000000008]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253738900000007]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253718200000004]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253729300000005]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253730100000006]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0640ab11386009488]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0924af1a13f38c82c]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0d54464eea313cb61]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-06a754dc7e546975f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a169b14c8d14fd3f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07af7bec87dc68ebf]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0313e8245f678a8ea]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07df29cf09e46847a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00a53d337fa341fc4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01a4879f14d9f69e4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05412ced6b2018325]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac0c439e4fbdb4dc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02336bd68343bb267]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06ffc133c3fe2f77f]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3249731164]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-1113048186]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-2287975513]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2308962083]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2472320124]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-204945054]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a169b14c8d14fd3f1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-052183efebe0a187b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c46fe44f7b79d13f]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08df75d58e8e5bd32]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0536dd736b0b700f8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-082f381f56f1cf8a4]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0011e14ef6aca8597]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=andrei-eks]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05872f795eb47015d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07df29cf09e46847a1080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=761770546894ce136652d2351aa4140ea750e426]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138735300000013]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138649900000011]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=andrei-eks20220318131138608100000010]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=andrei-eks2022031813113860660000000f]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138717900000012]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=andrei-eks-worker-group-120220318131138820500000015]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=andrei-eks-worker-group-220220318131138816800000014]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=andrei-eks-worker-group-220220318131150129100000017]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=andrei-eks-worker-group-120220318131150126500000016]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group.all_worker_mgmt has been changed
  ~ resource "aws_security_group" "all_worker_mgmt" {
        id                     = "sg-0313e8245f678a8ea"
        name                   = "all_worker_management2022031813030564620000000c"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # aws_security_group.worker_group_mgmt_one has been changed
  ~ resource "aws_security_group" "worker_group_mgmt_one" {
        id                     = "sg-06a754dc7e546975f"
        name                   = "worker_group_mgmt_one2022031813030563690000000a"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # aws_security_group.worker_group_mgmt_two has been changed
  ~ resource "aws_security_group" "worker_group_mgmt_two" {
        id                     = "sg-0640ab11386009488"
        name                   = "worker_group_mgmt_two20220318130305632500000009"
      + tags                   = {}
        # (9 unchanged attributes hidden)
    }
  # module.eks.aws_iam_role.workers[0] has been changed
  ~ resource "aws_iam_role" "workers" {
        id                    = "andrei-eks2022031813113780340000000e"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "andrei-eks2022031813113780340000000e"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.eks.aws_iam_policy.cluster_deny_log_group[0] has been changed
  ~ resource "aws_iam_policy" "cluster_deny_log_group" {
        id          = "arn:aws:iam::994647055425:policy/andrei-eks-deny-log-group20220318130253018900000003"
        name        = "andrei-eks-deny-log-group20220318130253018900000003"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_security_group_rule.workers_egress_internet[0] has been changed
  ~ resource "aws_security_group_rule" "workers_egress_internet" {
        id                = "sgrule-2472320124"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] has been changed
  ~ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
        id          = "arn:aws:iam::994647055425:policy/andrei-eks-elb-sl-role-creation20220318130253013100000001"
        name        = "andrei-eks-elb-sl-role-creation20220318130253013100000001"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_eks_cluster.this[0] has been changed
  ~ resource "aws_eks_cluster" "this" {
      + enabled_cluster_log_types = []
        id                        = "andrei-eks"
        name                      = "andrei-eks"
      + tags                      = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.eks.aws_security_group_rule.workers_ingress_self[0] has been changed
  ~ resource "aws_security_group_rule" "workers_ingress_self" {
      + cidr_blocks              = []
        id                       = "sgrule-1113048186"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      ~ to_port                  = 65535 -> 0
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_security_group.cluster[0] has been changed
  ~ resource "aws_security_group" "cluster" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow cluster egress access to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0924af1a13f38c82c"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow pods to communicate with the EKS cluster API."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d54464eea313cb61",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "andrei-eks2022031813030564420000000b"
        tags                   = {
            "Name" = "andrei-eks-eks_cluster_sg"
        }
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] has been changed
  ~ resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + cidr_blocks              = []
        id                       = "sgrule-2308962083"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
  # module.eks.kubernetes_config_map.aws_auth[0] has been changed
  ~ resource "kubernetes_config_map" "aws_auth" {
      + binary_data = {}
        id          = "kube-system/aws-auth"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + annotations      = {}
            name             = "aws-auth"
            # (5 unchanged attributes hidden)
        }
    }
  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] has been changed
  ~ resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + cidr_blocks              = []
        id                       = "sgrule-2287975513"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] has been changed
  ~ resource "aws_security_group_rule" "workers_ingress_cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-204945054"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
  # module.eks.aws_security_group_rule.cluster_egress_internet[0] has been changed
  ~ resource "aws_security_group_rule" "cluster_egress_internet" {
        id                = "sgrule-3249731164"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.eks.aws_autoscaling_group.workers[1] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
      + arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:53e88431-5b43-4d5d-93d3-6e0782f2738f:autoScalingGroupName/andrei-eks-worker-group-220220318131150129100000017"
      ~ availability_zones        = [
          + "eu-north-1a",
          + "eu-north-1b",
          + "eu-north-1c",
        ]
      + default_cooldown          = 300
      + enabled_metrics           = []
      + health_check_type         = "EC2"
        id                        = "andrei-eks-worker-group-220220318131150129100000017"
      + load_balancers            = []
      + name                      = "andrei-eks-worker-group-220220318131150129100000017"
      + service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      ~ suspended_processes       = [
          - "AZRebalance",
        ]
      + target_group_arns         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }
  # module.eks.aws_autoscaling_group.workers[0] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
      + arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:3f6ac6f3-1b45-4c2b-8009-7a1156e96a85:autoScalingGroupName/andrei-eks-worker-group-120220318131150126500000016"
      ~ availability_zones        = [
          + "eu-north-1a",
          + "eu-north-1b",
          + "eu-north-1c",
        ]
      + default_cooldown          = 300
      + enabled_metrics           = []
      + health_check_type         = "EC2"
        id                        = "andrei-eks-worker-group-120220318131150126500000016"
      + load_balancers            = []
      + name                      = "andrei-eks-worker-group-120220318131150126500000016"
      + service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      ~ suspended_processes       = [
          - "AZRebalance",
        ]
      + target_group_arns         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }
  # module.eks.aws_iam_instance_profile.workers[1] has been changed
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "andrei-eks20220318131138608100000010"
        name        = "andrei-eks20220318131138608100000010"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }
  # module.eks.aws_iam_instance_profile.workers[0] has been changed
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "andrei-eks2022031813113860660000000f"
        name        = "andrei-eks2022031813113860660000000f"
      + tags        = {}
        # (7 unchanged attributes hidden)
    }
  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
            - context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
            - name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "andrei-eks"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_andrei-eks" -> null
      - id                   = "761770546894ce136652d2351aa4140ea750e426" -> null
    }
  # module.eks.aws_launch_configuration.workers[1] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "andrei-eks-worker-group-220220318131138816800000014"
        name                             = "andrei-eks-worker-group-220220318131138816800000014"
      + vpc_classic_link_security_groups = []
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.aws_launch_configuration.workers[0] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "andrei-eks-worker-group-120220318131138820500000015"
        name                             = "andrei-eks-worker-group-120220318131138820500000015"
      + vpc_classic_link_security_groups = []
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.aws_iam_role.cluster[0] has been changed
  ~ resource "aws_iam_role" "cluster" {
        id                    = "andrei-eks20220318130253017400000002"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::994647055425:policy/andrei-eks-deny-log-group20220318130253018900000003",
          + "arn:aws:iam::994647055425:policy/andrei-eks-elb-sl-role-creation20220318130253013100000001",
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "andrei-eks20220318130253017400000002"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.eks.aws_security_group.workers[0] has been changed
  ~ resource "aws_security_group" "workers" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow nodes all egress to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0d54464eea313cb61"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow node to communicate with each other."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0924af1a13f38c82c",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow workers pods to receive communication from the cluster control plane."
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0924af1a13f38c82c",
                ]
              + self             = false
              + to_port          = 65535
            },
        ]
        name                   = "andrei-eks2022031813030564620000000d"
        tags                   = {
            "Name"                             = "andrei-eks-eks_worker_sg"
            "kubernetes.io/cluster/andrei-eks" = "owned"
        }
        # (7 unchanged attributes hidden)
    }
  # module.vpc.aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0dd4da1ed55a0115a"
        id                   = "eipalloc-0f739aa38270edde7"
      + network_interface    = "eni-01a722dfa238b023d"
      + private_dns          = "ip-10-0-4-173.eu-north-1.compute.internal"
      + private_ip           = "10.0.4.173"
        tags                 = {
            "Name"                             = "andrei-vpc-eu-north-1a"
            "kubernetes.io/cluster/andrei-eks" = "shared"
        }
        # (8 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-07df29cf09e46847a"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-05872f795eb47015d"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                             = "andrei-vpc-private"
            "kubernetes.io/cluster/andrei-eks" = "shared"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0a169b14c8d14fd3f"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-06ffc133c3fe2f77f"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                             = "andrei-vpc-public"
            "kubernetes.io/cluster/andrei-eks" = "shared"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group.workers[0] is tainted, so must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:3f6ac6f3-1b45-4c2b-8009-7a1156e96a85:autoScalingGroupName/andrei-eks-worker-group-120220318131150126500000016" -> (known after apply)
      ~ availability_zones        = [
          - "eu-north-1a",
          - "eu-north-1b",
          - "eu-north-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "andrei-eks-worker-group-120220318131150126500000016" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "andrei-eks-worker-group-120220318131150126500000016" -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      ~ suspended_processes       = [
          + "AZRebalance",
        ]
      - target_group_arns         = [] -> null
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] is tainted, so must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:53e88431-5b43-4d5d-93d3-6e0782f2738f:autoScalingGroupName/andrei-eks-worker-group-220220318131150129100000017" -> (known after apply)
      ~ availability_zones        = [
          - "eu-north-1a",
          - "eu-north-1b",
          - "eu-north-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "andrei-eks-worker-group-220220318131150129100000017" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "andrei-eks-worker-group-220220318131150129100000017" -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      ~ suspended_processes       = [
          + "AZRebalance",
        ]
      - target_group_arns         = [] -> null
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
            - context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
            - name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "andrei-eks"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_andrei-eks"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = null -> {}
          ~ metadata    = [
              ~ {
                  ~ annotations      = null -> {}
                    # (7 unchanged elements hidden)
                },
            ]
            # (2 unchanged elements hidden)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```